Tekla Open API Reference for Tekla Structures 2025
FabricatorProfilesAndMaterials Methods
The FabricatorProfilesAndMaterials type exposes the following members.
Methods
Name | Description
ConvertSourceFile
 Converts a fabricator profile catalog source file to an XML file that contains a list of valid Tekla Structures catalog profiles and materials.
Top
See Also
Reference
FabricatorProfilesAndMaterials Class
Tekla.Structures.Catalogs Namespace